# ==========================================
# โจทย์ข้อที่ 5: คำนวณค่าไฟฟ้าตามหน่วยที่ใช้
# Input: จำนวนหน่วยไฟฟ้าที่ใช้ (จำนวนเต็ม)
# Output: ค่าไฟฟ้ารวม (จำนวนเต็ม)
# เงื่อนไข: ไม่เกิน 50 หน่วย (หน่วยละ 3 บาท) | ไม่เกิน 100 หน่วย (หน่วยละ 4 บาท) | เกิน 100 หน่วย (หน่วยละ 5 บาท)
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
unit = int(input("จำนวนหน่วยไฟที่ใช้"))
if unit1 <=50 :
   print("หน่วยละ3บาท")
elif unit2 <=100 :
   print("หน่วยละ4บาท")
eise :
   print("หน่วยละ5บาท")

print(unit1 + unit2 + else = ค่าไฟรวม)

